1C_Final/Documents/ОказаниеУслугСлесаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОказаниеУслугСлесаря</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВызовыСлесарю</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СведенияОДомах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слесарь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1C_Final/Catalogs/ТарифыЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТарифыЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1C_Final/Documents/ОказаниеУслугСлесаря/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабЧасть2УслугаПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.ТабЧасть2.ТекущиеДанные;
	Если СтрТабЧасти.Услуга <> Неопределено Тогда 
		СтрТабЧасти.Цена = ОтборТарифа(СтрТабЧасти.Услуга);
	КонецЕсли;
	
КонецПроцедуры     
	
	&НаКлиенте
Процедура ТабЧасть2КоличествоПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.ТабЧасть2.ТекущиеДанные;
    СтрТабЧасти.Сумма = СтрТабЧасти.Количество * СтрТабЧасти.Цена;
	КонецПроцедуры

&НаСервере
функция ОтборТарифа(Услуга)
		Если Услуга = Неопределено Тогда
        Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
        Запрос.Текст =
		  "ВЫБРАТЬ
		  |	ТарифыЖКХ.ЦенаЗаЕдиницу КАК ЦенаЗаЕдиницу
		  |ИЗ
		  |	Справочник.ТарифыЖКХ КАК ТарифыЖКХ
		  |ГДЕ
		  |	ТарифыЖКХ.НаименованиеУслуги = &Услуга";
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ЦенаЗаЕдиницу;
    КонецЕсли;
    
    Возврат 0;	
КонецФункции
